console.log('true && "Так вышло" =', true && 'Так вышло')
console.log('false && "Так вышло" =', false && 'Так вышло')
console.log('null && "Так вышло" =', null && 'Так вышло')
console.log('{} && "Так вышло" =', {} && 'Так вышло')

console.log('==========================================')
console.log('==========================================')
console.log('==========================================')

console.log('true || "Так вышло" =', true || 'Так вышло')
console.log('false || "Так вышло" =', false || 'Так вышло')
console.log('null || "Так вышло" =', null || 'Так вышло')
console.log('{} || "Так вышло" =', {} || 'Так вышло')

